# Aula 1

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [4]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [5]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  str
 2   employment_type     133349 non-null  str
 3   job_title           133349 non-null  str
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  str
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  str
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  str
 10  company_size        133349 non-null  str
dtypes: float64(1), int64(3), str(7)
memory usage: 11.2 MB

In [6]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [7]:
df.shape

(133349, 11)

In [8]:
linhas, colunhas = df.shape
print("linhas:", linhas)
print("colunhas:", colunhas)

linhas: 133349
colunhas: 11

In [9]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='str')

In [11]:
df.rename(columns={'work_year': 'ano', 'experience_level': 'senioridade', 'employment_type': 'contrato', 'job_title': 'cargo', 'salary': 'salario', 'salary_currency': 'moeda', 'salary_in_usd': 'usd', 'employee_residence': 'residencia', 'remote_ratio': 'remoto', 'company_location': 'empresa', 'company_size': 'tamanho_empresa'}, inplace=True)

In [12]:
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [13]:
df["senioridade"].value_counts()
"""
EN - Entry-level (Nível de entrada)
MI - Mid-level (Nível médio)
SE - Senior-level (Nível sênior)
EX - Executive-level (Nível executivo)
"""

'\nEN - Entry-level (Nível de entrada)\nMI - Mid-level (Nível médio)\nSE - Senior-level (Nível sênior)\nEX - Executive-level (Nível executivo)\n'

In [14]:
df["contrato"].value_counts()
"""
FT - Full-time (Tempo integral)
PT - Part-time (Meio período)
CT - Contract (Contrato)
FL - Freelance (Freelancer)
"""

'\nFT - Full-time (Tempo integral)\nPT - Part-time (Meio período)\nCT - Contract (Contrato)\nFL - Freelance (Freelancer)\n'

In [17]:
df["remoto"].value_counts()
"""
0 - Presencial
50 - Híbrido
100 - Remoto
"""

'\n0 - Presencial\n50 - Híbrido\n100 - Remoto\n'

In [18]:
df["tamanho_empresa"].value_counts()
"""
M - Médio
S - Small (Pequeno)
L - Large (Grande)
"""

'\nM - Médio\nS - Small (Pequeno)\nL - Large (Grande)\n'

In [19]:
df["senioridade"] = df["senioridade"].replace({
    'EN': 'Nível de entrada',
    'MI': 'Nível médio',
    'SE': 'Nível sênior',
    'EX': 'Nível executivo'
})

In [20]:
df["remoto"] = df["remoto"].replace({
    0: 'Presencial',
    50: 'Híbrido',
    100: 'Remoto'
})

In [21]:
df["tamanho_empresa"] = df["tamanho_empresa"].replace({
    'M': 'Médio',
    'S': 'Pequeno',
    'L': 'Grande'
})

In [22]:
df.describe(include=['object', 'string'])

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Nível sênior,FT,Data Scientist,USD,US,Presencial,US,Médio
freq,77241,132563,17314,126140,119579,105312,119641,129561

# Aula 2

In [23]:
df.isnull()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
133344,False,False,False,False,False,False,False,False,False,False,False
133345,False,False,False,False,False,False,False,False,False,False,False
133346,False,False,False,False,False,False,False,False,False,False,False
133347,False,False,False,False,False,False,False,False,False,False,False
133348,False,False,False,False,False,False,False,False,False,False,False

In [24]:
df.isnull().sum()

ano                10
senioridade         0
contrato            0
cargo               0
salario             0
moeda               0
usd                 0
residencia          0
remoto              0
empresa             0
tamanho_empresa     0
dtype: int64

In [ ]:
df['ano'].unique()
"""
nan = Not a Number (Não é um número)
"""

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [26]:
df[df.isnull().any(axis=1)]

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
5588,NaN,Nível sênior,FT,Product Manager,184500,USD,184500,US,Presencial,US,Médio
59692,NaN,Nível médio,FT,Engineer,110000,USD,110000,DE,Presencial,DE,Médio
59710,NaN,Nível de entrada,FT,Data Scientist,208800,USD,208800,US,Presencial,US,Médio
59759,NaN,Nível sênior,FT,Software Engineer,135000,USD,135000,US,Presencial,US,Médio
59789,NaN,Nível sênior,FT,Engineer,112000,USD,112000,US,Presencial,US,Médio
131000,NaN,Nível sênior,FT,Machine Learning Engineer,163800,USD,163800,US,Presencial,US,Médio
131006,NaN,Nível sênior,FT,Data Analytics Manager,204500,USD,204500,US,Presencial,US,Médio
133054,NaN,Nível de entrada,FT,Data Scientist,40000,USD,40000,JP,Remoto,MY,Grande
133281,NaN,Nível médio,FT,Machine Learning Engineer,180000,PLN,46597,PL,Remoto,PL,Grande
133317,NaN,Nível médio,FT,Data Scientist,130000,USD,130000,US,Híbrido,US,Grande

In [ ]:
import numpy as np
df_salarios = pd.DataFrame({
    'nome': ["Ana",'Bruno','Carla','Daniel','Val'],
    'salario': [4000, np.nan, 5000, np.nan, 100000]
})
#Tudo que for nulo será preenchido com a média
df_salarios['salario_media'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2))
#Calcula a média salarial e substitui os valores nulos pela mediana, arredondando os valores para 2 casas decimais

df_salarios

     nome   salario  salario_media
0     Ana    4000.0        4000.00
1   Bruno       NaN       36333.33
2   Carla    5000.0        5000.00
3  Daniel       NaN       36333.33
4     Val  100000.0      100000.00

In [ ]:
#Calcula a mediana salarial e substitui os valores nulos pela mediana, arredondando os valores para 2 casas decimais
df_salarios['salario_mediana'] = df_salarios['salario'].fillna(df_salarios['salario'].median().round(2))
df_salarios

     nome   salario  salario_media  salario_mediana
0     Ana    4000.0        4000.00           4000.0
1   Bruno       NaN       36333.33           5000.0
2   Carla    5000.0        5000.00           5000.0
3  Daniel       NaN       36333.33           5000.0
4     Val  100000.0      100000.00         100000.0

In [35]:
df_temperaturas = pd.DataFrame({
    'Dia': ["Segunda", "Terça", "Quarta", "Quinta", "Sexta"],
    'Temperatura': [30, np.nan, np.nan, 28, 27]
})
df_temperaturas['preenchido_ffill'] = df_temperaturas['Temperatura'].ffill()
df_temperaturas

       Dia  Temperatura  preenchido_ffill
0  Segunda         30.0              30.0
1    Terça          NaN              30.0
2   Quarta          NaN              30.0
3   Quinta         28.0              28.0
4    Sexta         27.0              27.0

In [37]:
df_temperaturas['preenchido_bfill'] = df_temperaturas['Temperatura'].bfill()
df_temperaturas

       Dia  Temperatura  preenchido_ffill  preenchido_bfill
0  Segunda         30.0              30.0              30.0
1    Terça          NaN              30.0              28.0
2   Quarta          NaN              30.0              28.0
3   Quinta         28.0              28.0              28.0
4    Sexta         27.0              27.0              27.0

In [43]:
df_cidades = pd.DataFrame({
    'nome': ["Ana", "Bruno", "Carla", "Daniel", "Val"],
    'cidade': ["São Paulo", np.nan, "Curitiba", np.nan, "Belém"]
})

df_cidades['cidade_preenchida'] = df_cidades['cidade'].fillna('Não informado')
df_cidades

     nome     cidade cidade_preenchida
0     Ana  São Paulo         São Paulo
1   Bruno        NaN     Não informado
2   Carla   Curitiba          Curitiba
3  Daniel        NaN     Não informado
4     Val      Belém             Belém

In [44]:
df_limpo = df.dropna()  # Remove todas as linhas com valores nulos
df_limpo.isnull().sum()

ano                0
senioridade        0
contrato           0
cargo              0
salario            0
moeda              0
usd                0
residencia         0
remoto             0
empresa            0
tamanho_empresa    0
dtype: int64

In [48]:
df_limpo.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025,Nível sênior,FT,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio
1,2025,Nível sênior,FT,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio
2,2025,Nível médio,FT,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio
3,2025,Nível médio,FT,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio
4,2025,Nível de entrada,FT,Data Engineer,90000,USD,90000,US,Presencial,US,Médio

In [47]:
df_limpo = df_limpo.assign(ano = df_limpo['ano'].astype('Int64'))